weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TSOI */
#define IFX_PSI5_INTSTATA_TSOI_OFF (13u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_OFF (14u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_OFF (15u)

/** \brief Length for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_OFF (16u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI0 */
#define IFX_PSI5_INTSTATB_WSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_OFF (3u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_OFF (4u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_OFF (5u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI0 */
#define IFX_PSI5_INTSTATB_SDI0_OFF (6u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI1 */
#define IFX_PSI5_INTSTATB_SDI1_OFF (7u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI2 */
#define IFX_PSI5_INTSTATB_SDI2_OFF (8u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI3 */
#define IFX_PSI5_INTSTATB_SDI3_OFF (9u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI4 */
#define IFX_PSI5_INTSTATB_SDI4_OFF (10u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SDI5 */
#define IFX_PSI5_INTSTATB_SDI5_OFF (11u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI0 */
#define IFX_PSI5_INTSTATB_SOI0_OFF (12u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI1 */
#define IFX_PSI5_INTSTATB_SOI1_OFF (13u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI2 */
#define IFX_PSI5_INTSTATB_SOI2_OFF (14u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI3 */
#define IFX_PSI5_INTSTATB_SOI3_OFF (15u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI4 */
#define IFX_PSI5_INTSTATB_SOI4_OFF (16u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SOI5 */
#define IFX_PSI5_INTSTATB_SOI5_OFF (17u)

/** \brief Length for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTSTATB_Bits.SCRI0 */
#define IFX_PSI5_INTSTATB_SCRI0_OFF (18u)

