weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI3 */
#define IFX_PSI5_INTENB_SDI3_OFF (9u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI4 */
#define IFX_PSI5_INTENB_SDI4_OFF (10u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SDI5 */
#define IFX_PSI5_INTENB_SDI5_OFF (11u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI0 */
#define IFX_PSI5_INTENB_SOI0_OFF (12u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI1 */
#define IFX_PSI5_INTENB_SOI1_OFF (13u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI2 */
#define IFX_PSI5_INTENB_SOI2_OFF (14u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI3 */
#define IFX_PSI5_INTENB_SOI3_OFF (15u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI4 */
#define IFX_PSI5_INTENB_SOI4_OFF (16u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SOI5 */
#define IFX_PSI5_INTENB_SOI5_OFF (17u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI0 */
#define IFX_PSI5_INTENB_SCRI0_OFF (18u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI1 */
#define IFX_PSI5_INTENB_SCRI1_OFF (19u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI2 */
#define IFX_PSI5_INTENB_SCRI2_OFF (20u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI3 */
#define IFX_PSI5_INTENB_SCRI3_OFF (21u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI4 */
#define IFX_PSI5_INTENB_SCRI4_OFF (22u)

/** \brief Length for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_INTENB_Bits.SCRI5 */
#define IFX_PSI5_INTENB_SCRI5_OFF (23u)

/** \brief Length for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN0 */
#define IFX_PSI5_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN0 */
#define IFX_PSI5_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN0 */
#define IFX_PSI5_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN1 */
#define IFX_PSI5_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN1 */
#define IFX_PSI5_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN1 */
#define IFX_PSI5_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN2 */
#define IFX_PSI5_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN3 */
#define IFX_PSI5_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN4 */
#define IFX_PSI5_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN5 */
#define IFX_PSI5_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN6 */
#define IFX_PSI5_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN7 */
#define IFX_PSI5_ACCEN0_EN7_LEN (1u)

