weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_OFF (26u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_OFF (27u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_OFF (28u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_OFF (29u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_OFF (30u)

/** \brief Length for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_OFF (31u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI1 */
#define IFX_PSI5_RSISET_RSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI2 */
#define IFX_PSI5_RSISET_RSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI3 */
#define IFX_PSI5_RSISET_RSI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI4 */
#define IFX_PSI5_RSISET_RSI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI5 */
#define IFX_PSI5_RSISET_RSI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI6 */
#define IFX_PSI5_RSISET_RSI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI7 */
#define IFX_PSI5_RSISET_RSI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI8 */
#define IFX_PSI5_RSISET_RSI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI9 */
#define IFX_PSI5_RSISET_RSI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI12 */
#define IFX_PSI5_RSISET_RSI12_OFF (12u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI13 */
#define IFX_PSI5_RSISET_RSI13_OFF (13u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI14 */
#define IFX_PSI5_RSISET_RSI14_OFF (14u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI15 */
#define IFX_PSI5_RSISET_RSI15_OFF (15u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSISET_Bits.RSI16 */
#define IFX_PSI5_RSISET_RSI16_OFF (16u)

/** \brief Length for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSISET_Bits.RSI17 */
#define IFX_PSI5_RSISET_RSI17_MSK (0x1u)

