weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_OFF (7u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_OFF (8u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_OFF (9u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI10 */
#define IFX_PSI5_NFISET_NFI10_OFF (10u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI11 */
#define IFX_PSI5_NFISET_NFI11_OFF (11u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI12 */
#define IFX_PSI5_NFISET_NFI12_OFF (12u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI13 */
#define IFX_PSI5_NFISET_NFI13_OFF (13u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI14 */
#define IFX_PSI5_NFISET_NFI14_OFF (14u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI15 */
#define IFX_PSI5_NFISET_NFI15_OFF (15u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI16 */
#define IFX_PSI5_NFISET_NFI16_OFF (16u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI17 */
#define IFX_PSI5_NFISET_NFI17_OFF (17u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI18 */
#define IFX_PSI5_NFISET_NFI18_OFF (18u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI19 */
#define IFX_PSI5_NFISET_NFI19_OFF (19u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI20 */
#define IFX_PSI5_NFISET_NFI20_OFF (20u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI21 */
#define IFX_PSI5_NFISET_NFI21_OFF (21u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI22 */
#define IFX_PSI5_NFISET_NFI22_OFF (22u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI23 */
#define IFX_PSI5_NFISET_NFI23_OFF (23u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI24 */
#define IFX_PSI5_NFISET_NFI24_OFF (24u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI25 */
#define IFX_PSI5_NFISET_NFI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI25 */
#define IFX_PSI5_NFISET_NFI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI25 */
#define IFX_PSI5_NFISET_NFI25_OFF (25u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI26 */
#define IFX_PSI5_NFISET_NFI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI26 */
#define IFX_PSI5_NFISET_NFI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI26 */
#define IFX_PSI5_NFISET_NFI26_OFF (26u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI27 */
#define IFX_PSI5_NFISET_NFI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI27 */
#define IFX_PSI5_NFISET_NFI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI27 */
#define IFX_PSI5_NFISET_NFI27_OFF (27u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI28 */
#define IFX_PSI5_NFISET_NFI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI28 */
#define IFX_PSI5_NFISET_NFI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFISET_Bits.NFI28 */
#define IFX_PSI5_NFISET_NFI28_OFF (28u)

/** \brief Length for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFISET_Bits.NFI29 */
#define IFX_PSI5_NFISET_NFI29_MSK (0x1u)

